Revit 2026 API

# RebarGetHookRotationAngle Method

---

**Note: This API is now obsolete.**

Gets the termination's out of plane rotation angle at the specified end. The rotation angle it's the same for both hook and crank.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.GetTerminationRotationAngle instead.")]
public double GetHookRotationAngle(
	int end
)
```
```vb
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.GetTerminationRotationAngle instead.")>
Public Function GetHookRotationAngle (
	end As Integer
) As Double
```
```cpp
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.GetTerminationRotationAngle instead.")]
double GetHookRotationAngle(
	int end
)
```
```fsharp
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.GetTerminationRotationAngle instead.")>]
member GetHookRotationAngle :
        end : int -> float
```

#### Parameters

end Int32
     0 for the start, 1 for the end.

#### Return Value

Double Returns the termination's out of plane rotation angle at the specified end. The rotation angle it's the same for both hook and crank.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | end must be 0 or 1. |

#### Reference

Rebar Class

Autodesk.Revit.DB.Structure Namespace